Public Member Functions | Friends | List of all members
ACAPI::MEP::AccessoryDefault Class Referencefinal
MEP Element Manager
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element. More...
#include <MEPAccessoryDefault.hpp>
 Inheritance diagram for ACAPI::MEP::AccessoryDefault:
 Public Member Functions
Result< UniqueID >  | Place (const API_Coord3D &coordinate, const Orientation &orientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places an Accessory element based on this Default.
Result< UniqueID >  | Place (const UniqueID &portOrNodeId, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places an Accessory element based on this Default and connects it with the provided Port or RoutingNode, if it is possible.
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< AccessoryDefault >  | CreateAccessoryDefault (Domain domain)
Creates an AccessoryDefault.
MEPAPI_EXPORT Result< AccessoryDefault >  | CreateAccessoryDefault (const ACAPI::ElementDefault &defaultElem)
Creates an AccessoryDefault from the given base element default.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element.
Since
Archicad 27
Example code snippet from Test / New MEP
Placement
 {
 auto ductAccessoryDefault = CreateAccessoryDefault (Domain::Ventilation);
 if (ductAccessoryDefault.IsErr ())
 return ductAccessoryDefault.UnwrapErr ().kind;
 ACAPI::Result<UniqueID> accessoryId = ductAccessoryDefault->Place ({ 0.0, 13.0, 0.0 }, { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GenerateAPIGuid ());
 if (accessoryId.IsErr ())
 return accessoryId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation Accessory placed successfully", false);
 }
 {
 auto pipeAccessoryDefault = CreateAccessoryDefault (Domain::Piping);
 if (pipeAccessoryDefault.IsErr ())
 return pipeAccessoryDefault.UnwrapErr ().kind;
 ACAPI::Result<UniqueID> accessoryId = pipeAccessoryDefault->Place ({ 10.0, 13.0, 0.0 }, { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GenerateAPIGuid ());
 if (accessoryId.IsErr ())
 return accessoryId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Piping Accessory placed successfully", false);
 }
Member Function Documentation
◆ Place() [1/2]
 Result< UniqueID > ACAPI::MEP::AccessoryDefault::Place  |  ( |  const API_Coord3D & |  coordinate,
|  const Orientation & |  orientation,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places an Accessory element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
coordinate | The coordinate where the Accessory will be placed.
orientation | The orientation of the Accessory, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the Accessory - optional parameter
Returns
If executed with success, returns the newly placed Accessory's uniqueId, otherwise Error.
◆ Place() [2/2]
 Result< UniqueID > ACAPI::MEP::AccessoryDefault::Place  |  ( |  const UniqueID & |  portOrNodeId,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places an Accessory element based on this Default and connects it with the provided Port or RoutingNode, if it is possible.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
portOrNodeId | The id of a Port or RoutingNode, which provides the placed Accessory's position and orientation.
requiredId | The guid to be set for the Accessory - optional parameter
Returns
If executed with success, returns the newly placed Terminal's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateAccessoryDefault [1/2]
 MEPAPI_EXPORT Result< AccessoryDefault > CreateAccessoryDefault  |  ( |  const ACAPI::ElementDefault & |  defaultElem | )
friend
Creates an AccessoryDefault from the given base element default.
Parameters
defaultElem | The base element default which will be converted to an AccessoryDefault.
Since
Archicad 29
Returns
If the given base element default refers to an Accessory, returns a copy of the AccessoryDefault, otherwise Error.
◆ CreateAccessoryDefault [2/2]
 Result< AccessoryDefault > CreateAccessoryDefault  |  ( |  Domain |  domain | )
friend
Creates an AccessoryDefault.
Parameters
domain | The Domain of the requested AccessoryDefault. It can be ventilation or piping.
Returns
If able, returns a copy of Archicad's current Default of the Accessory tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).